# Домашнее задание
# Создай две переменные x и y и присвой им любые целые значения.
# Выведи результаты основных арифметических операций между x и y.
# Используй операторы сравнения, чтобы проверить, больше ли x, чем y, и равны ли они.
# Создай условие, которое проверяет, является ли x положительным числом и больше ли оно y.

x = 5
y = 10
print("Сложение:", x + y)
print("Вычитание:", x - y)
print("Умножение:", x * y)
print("Деление:", x / y)
print("Целочисленное деление:",x //y)
print("Остаток от деления:", x % y)
print("Возведение в степень:", x ** y)

# Операторы сравнения
print("x больше y?", x > y)
print("x равно y?", x == y)

# Логические операторы
print('x > 0 и x > y', x > 0 and x > y)

